{"keras_version": "1.2.2", "config": [{"config": {"go_backwards": false, "U_regularizer": null, "name": "lstm_1", "unroll": false, "return_sequences": true, "input_dtype": "float32", "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "dropout_U": 0.0, "init": "glorot_uniform", "dropout_W": 0.0, "trainable": true, "stateful": true, "inner_activation": "hard_sigmoid", "batch_input_shape": [1, 1, 78], "consume_less": "cpu", "inner_init": "orthogonal", "output_dim": 78, "forget_bias_init": "one"}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "go_backwards": false, "U_regularizer": null, "inner_activation": "hard_sigmoid", "unroll": false, "return_sequences": true, "W_regularizer": null, "stateful": false, "activation": "softmax", "b_regularizer": null, "dropout_U": 0.0, "forget_bias_init": "one", "trainable": true, "input_dim": 78, "input_length": null, "name": "lstm_2", "consume_less": "cpu", "inner_init": "orthogonal", "output_dim": 78, "dropout_W": 0.0}, "class_name": "LSTM"}], "class_name": "Sequential"}