{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "LSTM", "config": {"U_regularizer": null, "batch_input_shape": [1, 1, 78], "trainable": true, "go_backwards": false, "output_dim": 78, "init": "glorot_uniform", "return_sequences": true, "dropout_W": 0.0, "dropout_U": 0.0, "name": "lstm_1", "activation": "tanh", "b_regularizer": null, "inner_activation": "hard_sigmoid", "unroll": false, "consume_less": "cpu", "stateful": true, "W_regularizer": null, "input_dtype": "float32", "inner_init": "orthogonal", "forget_bias_init": "one"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "trainable": true, "go_backwards": false, "output_dim": 78, "input_dim": 78, "return_sequences": true, "dropout_W": 0.0, "input_length": null, "name": "lstm_2", "init": "glorot_uniform", "dropout_U": 0.0, "b_regularizer": null, "inner_activation": "hard_sigmoid", "unroll": false, "consume_less": "cpu", "stateful": false, "W_regularizer": null, "activation": "softmax", "inner_init": "orthogonal", "forget_bias_init": "one"}}]}