{"config": [{"config": {"dtype": "float32", "unroll": false, "batch_input_shape": [null, 20, 1], "trainable": true, "unit_forget_bias": true, "name": "lstm_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "implementation": 0, "return_sequences": false, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "units": 128, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "units": 128}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Sequential"}